ХамелионЦРПТ/src/InformationRegisters/НастройкиПрограммы_ХамелеонЦРПТ/НастройкиПрограммы_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПрограммы_ХамелеонЦРПТ</name>
  <resources>
    <name>ЗаписыватьДанныеПриОтправкеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОткрытьPDFЧерезВнешнююПрограмму</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТаймаутОжиданияОтСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТаймаутОжиданияПослеПлученияКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасчетОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиОбрабатыватьОшибкуТакаяУпаковкаУжеЕсть</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбработкаWEBНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДобавитьПрефиксДляGS1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьТокен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверкаНомеровКМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьПоУмолчаниюАгрегациюЧерезСУЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьОплатуЗаказаЗаКМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РаботатьНаV1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьАгрегациюПоGTIN</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗадержкаЧерезЦикл</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьОбувьЧерезAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриЗаполненииОтгрузкиНеУчитыватьОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьCAPICOM_CERTIFICATE_INCLUDE_END_ENTITY_ONLY</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриПроверкеСхемыПриОтгрузкеЕслиОшибкаНеФормироватьФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЯдерДляГенерацииDataMatrix</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьCSV</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьОтгрузкуВФормате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлюКапчи</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>НеПисатьВЖурналРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодключатьсяАвтоматическиПоЦРПТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗагрузатьНаименованиеПриПриемке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОпределятьНазваниеНеИзЦРПТПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьНеУчастнику</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодверждатьЗакрытиеХамелеонЦРПТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСайтGS1ПоМаркировке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДобавитьFNCПриПечатиУпаковок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДобавитьДваНуля</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОтчетОбИспользованияДлМолока</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеЭмитировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПослеОтправкиОтчетовВСУЗПодписать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолучитьТокенНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗагрузитьПриемкуЭДОЛайт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодТовараВУПД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоКМВЗаказеОтображаемое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрузитьПоступленияТолькоСМаркировкойПоЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БратьКоличествоИзТабличойЧасти</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриФормированииXMLНеПолучитьИнформациюОКМВоВложении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыводитьВспомогательноеПолеИзОтгрузкиВПолеID</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БратьGLNОрганизацииДляФормированииАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриЗагрузкеПриемкиЗаполнятьПроверкаПоКМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УбратьПриемкуЕслиНетСопоставления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьАртикулНачалоРазмерКонец</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриСканированииВПриемкеИскатьСтрочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗагружатьВсеПриходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоийПодсчетСуммыПоКМИзКороба</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьЭДОЛайтЧерезXML</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭДОЗаписыватьИныеСведенияВКомментарийПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Использовать15ШаблонДляАльтернативногоТабакаСУказаниемМРЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриФормированииXMLДобавлятьКМПоКоробам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбрезатьКМДляТабака</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриЗагрузкеИзЭДООбновлятьНазваниеПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверятьПередОтправкойНомерКоробаИСоздаватьНовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеДобавлятьКМПриФормированииXML</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьАгрегатПоНовому</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗнаковВКМАгрегата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КачатьСЭДОЗаПоследниеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтправлятьВЭДООткрепленнуюПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверятьНаДубльПозицийВОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УбиратьСкобкиПриСканировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбновлятьСтатусыЗаказовКМСДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИздаватьЗвукПрИНеправильнойКМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПриЗагрузкеИнформацииПоЭДОПриемкаВКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодВУчетнойСистемеИзXML</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОбновлятьКодВУчетнойСистеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапрещатьРедактироватьПриемкуЕслиОнаОтправленаИлиОбработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриОтправкеВCSVУмножатьСуммыНа100</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриОтправкеВЦРТИЭДОПроверятьСтатусКМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьВкладкуТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолучатьКМВФоне</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/InformationRegisters/ЗапускРегламентыхЗаданий_ХамелеонЦРПТ/ЗапускРегламентыхЗаданий_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапускРегламентыхЗаданий_ХамелеонЦРПТ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>НазваниеАлгоритма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗапуска</name>
    <type>
      <types>EnumRef.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/Enums/ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ/ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Запуск</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Остановка</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Documents/Регламенты_ХамелеонЦРПТ/Регламенты_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Регламенты_ХамелеонЦРПТ</name>
  <attributes>
    <name>ВыполнятьРегламент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипЗапросаОбработки</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>CatalogRef.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ХамелионЦРПТ/src/CommonModules/ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ/Module.bsl
Функция ЧислоDecToHex(Знач Исходное, Знач НужноЦифр = 2)
	ЧислаБайтHex = "000102030405060708090A0B0C0D0E0F101112131415161718191A1B1C1D1E1F202122232425262728292A2B2C2D2E2F303132333435363738393A3B3C3D3E3F404142434445464748494A4B4C4D4E4F505152535455565758595A5B5C5D5E5F606162636465666768696A6B6C6D6E6F707172737475767778797A7B7C7D7E7F808182838485868788898A8B8C8D8E8F909192939495969798999A9B9C9D9E9FA0A1A2A3A4A5A6A7A8A9AAABACADAEAFB0B1B2B3B4B5B6B7B8B9BABBBCBDBEBFC0C1C2C3C4C5C6C7C8C9CACBCCCDCECFD0D1D2D3D4D5D6D7D8D9DADBDCDDDEDFE0E1E2E3E4E5E6E7E8E9EAEBECEDEEEFF0F1F2F3F4F5F6F7F8F9FAFBFCFDFEFF";
	
	Если НужноЦифр = 2 Тогда
		Возврат Сред(ЧислаБайтHex, Исходное * 2 + 1, 2);
	КонецЕсли; 
	
	ЧислаHex = "0123456789ABCDEF";
	Результат = "";
	Для Цифр = 1 По НужноЦифр Цикл
		ТекЦифра = Исходное % 16;
		Исходное = Цел(Исходное / 16);
		Результат = Сред(ЧислаHex, ТекЦифра + 1, 1) + Результат;
	КонецЦикла; 
	Возврат Результат;
КонецФункции // ЧислоDecToHex()



Функция ТекстUnicodeToUTF8(Стр)
	ЧислаБайтHex = "000102030405060708090A0B0C0D0E0F101112131415161718191A1B1C1D1E1F202122232425262728292A2B2C2D2E2F303132333435363738393A3B3C3D3E3F404142434445464748494A4B4C4D4E4F505152535455565758595A5B5C5D5E5F606162636465666768696A6B6C6D6E6F707172737475767778797A7B7C7D7E7F808182838485868788898A8B8C8D8E8F909192939495969798999A9B9C9D9E9FA0A1A2A3A4A5A6A7A8A9AAABACADAEAFB0B1B2B3B4B5B6B7B8B9BABBBCBDBEBFC0C1C2C3C4C5C6C7C8C9CACBCCCDCECFD0D1D2D3D4D5D6D7D8D9DADBDCDDDEDFE0E1E2E3E4E5E6E7E8E9EAEBECEDEEEFF0F1F2F3F4F5F6F7F8F9FAFBFCFDFEFF";
	БезопасныеСимволы = "-.0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ_abcdefghijklmnopqrstuvwxyz~";
	ИтогСтр = "";
	
	Для й = 1 По СтрДлина(Стр) Цикл
		ТекСимв = Сред(Стр, й, 1);
		
		Если ТекСимв = " " Тогда
			ИтогСтр = ИтогСтр + "+";
			Продолжить;
		КонецЕсли; 
		Если Найти(БезопасныеСимволы, ТекСимв) > 0 Тогда
			ИтогСтр = ИтогСтр + ТекСимв;
			Продолжить;
		КонецЕсли; 
		
		Код = КодСимвола(ТекСимв);
		Если Код < 128 Тогда
			ИтогСтр = ИтогСтр + "%" + ЧислоDecToHex(Код);
		Иначе
			///////		Конвертация Unicode в UTF-8 в полном соответствии со спецификацией!  (http://ru.wikipedia.org/wiki/UTF-8)
			Делитель = 32;	Нашлёпка = 8;	КодХекс = "";
			Пока Делитель > 4 Цикл
				//////	Установка следующих за первым байтов
				ТекБайт = Код % 64;
				КодХекс = "%" + ЧислоDecToHex(128 + ТекБайт) + КодХекс;
				
				Код		= Цел(Код / 64);
				//////	Проверка на закрывающий байт
				Если Код < Делитель Тогда
					КодХекс = "%" + ЧислоDecToHex((Нашлёпка-2) * Делитель + Код) + КодХекс;
					Прервать;
				КонецЕсли;
				//////	Переход к следующему уровню закрытия
				Делитель = Делитель / 2;
				Нашлёпка = Нашлёпка * 2;
			КонецЦикла; 
			ИтогСтр = ИтогСтр + КодХекс;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат ИтогСтр;
КонецФункции // ТекстUnicodeToUTF8()
 


Функция ВернутьЗаданияИВремяВыполнения(ВремяПоследнегоВыполнения) Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Регламенты_ХамелеонЦРПТТипЗапросаОбработки.Тип,
		|	Регламенты_ХамелеонЦРПТТипЗапросаОбработки.Время КАК Время,
		|	Регламенты_ХамелеонЦРПТТипЗапросаОбработки.Тип.Алгоритм КАК Алгоритм,
		|	Регламенты_ХамелеонЦРПТТипЗапросаОбработки.Тип.ВыполнитьНаКлиенте КАК ВыполнитьНаКлиенте,
		|	Регламенты_ХамелеонЦРПТТипЗапросаОбработки.Тип.Наименование КАК Наименование
		|ИЗ
		|	Документ.Регламенты_ХамелеонЦРПТ.ТипЗапросаОбработки КАК Регламенты_ХамелеонЦРПТТипЗапросаОбработки
		|ГДЕ
		|	Регламенты_ХамелеонЦРПТТипЗапросаОбработки.Выполнять
		|	И Регламенты_ХамелеонЦРПТТипЗапросаОбработки.Ссылка.ВыполнятьРегламент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Время";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивСтруктурВыполненияЗапросов=Новый Массив;
	МассивАлгоритмаЕсть=Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		МассивСтруктурВыполненияЗапросов.Добавить(Новый Структура("Тип,Время,Алгоритм,НаКлиенте,Наименование",ВыборкаДетальныеЗаписи.Тип,ВыборкаДетальныеЗаписи.Время,ВыборкаДетальныеЗаписи.Алгоритм,ВыборкаДетальныеЗаписи.ВыполнитьНаКлиенте,ВыборкаДетальныеЗаписи.Наименование));
	КонецЦикла;
	ВремяПоследнегоВыполнения=Константы.ВремяПоследнегоВыполненияРегламента_ХамелеонЦРПТ.Получить();
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Возврат МассивСтруктурВыполненияЗапросов;
	
КонецФункции


Процедура УстановитьДатуВремя(ТекДата)  Экспорт
	Попытка
		Константы.ВремяПоследнегоВыполненияРегламента_ХамелеонЦРПТ.Установить(ТекДата);
	исключение
	КонецПопытки;
КонецПроцедуры
	
	
Процедура ВыполнитьНаСервере(Алгоритм) Экспорт
//	Попытка
//		Выполнить(Алгоритм.Алгоритм);
	Попытка
		ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.ЗаписатьВЖурналРегламент(Алгоритм.Наименование,Предопределенноезначение("Перечисление.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Запуск"),"");
		
		Выполнить(Алгоритм.Алгоритм);
		ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.ЗаписатьВЖурналРегламент(Алгоритм.Наименование,Предопределенноезначение("Перечисление.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Остановка"),"");
	Исключение
		ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.ЗаписатьВЖурналРегламент(Алгоритм.Наименование,Предопределенноезначение("Перечисление.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Ошибка"),ОписаниеОшибки());
	КонецПопытки;
		
		//	Исключение
//	КонецПопытки;
КонецПроцедуры



Процедура ЗаписатьВЖурналРегламент(Наименование,ТипЗапуска,Ошибка) Экспорт
	Если не РегистрыСведений.НастройкиПрограммы_ХамелеонЦРПТ.Получить().НеПисатьВЖурналРегламентныеЗадания Тогда
		ТекДата=ТекущаяДата();
		РегСвНабор=РегистрыСведений.ЗапускРегламентыхЗаданий_ХамелеонЦРПТ.СоздатьНаборЗаписей();
		РегСвНабор.Отбор.Период.Установить(текДата);
		РегсвНабор.Отбор.НазваниеАлгоритма.Установить(Наименование);
		РегСвНабор.Отбор.ТипЗапуска.Установить(типЗапуска);
		Доб=РегСвНабор.Добавить();
		доб.НазваниеАлгоритма=Наименование;
		Доб.Ошибка=Ошибка;
		Доб.Период=ТекДата;
		Доб.ТипЗапуска=ТипЗапуска;
		РегСвНабор.Записать(Истина);
	КонецЕсли;
КонецПроцедуры
